src/Catalogs/Scan_СоставляющиеРасчетаЦеныПродуктов/Scan_СоставляющиеРасчетаЦеныПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоставляющиеРасчетаЦеныПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИтоговыеЦены</name>
      <description>Итоговые цены</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаДилера</name>
      <description>Коэффициенты для цены на дилера</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаКлиента</name>
      <description>Коэффициенты для цены на клиента</description>
    </items>
    <items>
      <name>НерасчетныеСоставляющие</name>
      <description>Нерасчетные составляющие</description>
    </items>
    <items>
      <name>РасчетныеСоставляющие</name>
      <description>Расчетные составляющие</description>
    </items>
    <items>
      <name>СкидкиНаценки</name>
      <description>Скидки, наценки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВариантФормированияРасчета</name>
    <type>
      <types>EnumRef.Scan_ВариантыФормированияРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВКалькуляцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиКалькуляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Применимость</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрядностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЦены</name>
    <type>
      <types>EnumRef.Scan_ТипыСоставляющихРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяПакетомУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииПакетаУслуг</name>
    <attributes>
      <name>БазоваяОпция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточнениеЗначенийПоУмолчанию</name>
    <attributes>
      <name>ИдентификаторПрайсЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов/Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>EnumRef.Scan_ТипыСоставляющихРасчетаСоставляющихЦены</types>
      <types>CatalogRef.Валюты</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
      <types>String</types>
      <types>Number</types>
      <types>EnumRef.Scan_ВариантыФормированияРасчетаСоставляющихЦены</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>СоставляющаяРасчета</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоСоставляющимРасчетаЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ДополнительнаяИнформацияПоСоставляющимРасчетаЦен/Scan_ДополнительнаяИнформацияПоСоставляющимРасчетаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДополнительнаяИнформацияПоСоставляющимРасчетаЦен</name>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>НаименованиеРус</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>ВариантФормированияРасчета</name>
  </enumValues>
  <enumValues>
    <name>ФормулаРасчета</name>
  </enumValues>
  <enumValues>
    <name>Идентификатор</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>ЦветСтрокиКалькуляции</name>
  </enumValues>
  <enumValues>
    <name>ЦветТекстаСтрокиКалькуляции</name>
  </enumValues>
  <enumValues>
    <name>ШрифтСтрокиКалькуляции</name>
  </enumValues>
  <enumValues>
    <name>ЯвляетсяПакетомУслуг</name>
  </enumValues>
  <enumValues>
    <name>ВыводитьВКалькуляцию</name>
  </enumValues>
  <enumValues>
    <name>Валюта</name>
  </enumValues>
  <enumValues>
    <name>НомерСтрокиКалькуляции</name>
  </enumValues>
  <enumValues>
    <name>Опция</name>
  </enumValues>
  <enumValues>
    <name>ТипСоставляющейЦены</name>
  </enumValues>
  <enumValues>
    <name>Применимость</name>
  </enumValues>
  <enumValues>
    <name>Принадлежность</name>
  </enumValues>
  <enumValues>
    <name>РазрядностьОкругления</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_СоставляющиеРасчетаЦеныПродуктов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ИзмРекв;
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), Истина, Ложь));
	
	ИзмРекв = Новый Массив;
	//Если новый - запишем заполненные реквизиты
	Если ЭтотОбъект.ЭтоНовый() тогда
		Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("Булево") и ЭтотОбъект[Рекв.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Рекв.Имя]) Тогда
				Продолжить;
			ИначеЕсли ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("ХранилищеЗначения") Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Рекв.Имя);
		КонецЦикла;
	Иначе  //если не новый - то измененные
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеЗаписыватьВРегистр") Тогда 
			Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
				Если  (ЭтотОбъект[Рекв.Имя] <> ссылка[Рекв.Имя])
					И ТипЗнч(ЭтотОбъект[Рекв.Имя]) <> Тип("ХранилищеЗначения")
					Тогда
					ИзмРекв.Добавить(Рекв.Имя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//для старых объектов, у которых нет данных в регистре - запишем заполненные
	Если ИзмРекв.Количество() = 0 и  НетИсторииВРегистре(ссылка) Тогда
		Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("Булево") и ЭтотОбъект[Рекв.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Рекв.Имя]) Тогда
				Продолжить;
			ИначеЕсли ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("ХранилищеЗначения") Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Рекв.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Идентификатор  = СокрЛП(Идентификатор);
	ФормулаРасчета = СокрЛП(ФормулаРасчета);
	
	Если ДатаСоздания = Дата(1,1,1) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		АвторизованныйПользователь = ПользователиСлужебный.АвторизованныйПользователь();
		Для Каждого Реквизит Из ИзмРекв Цикл
			НоваяЗапись = РегистрыСведений.Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.СоставляющаяРасчета = Ссылка;
			НоваяЗапись.ВидЗначения         = Перечисления.Scan_ДополнительнаяИнформацияПоСоставляющимРасчетаЦен[Реквизит];
			НоваяЗапись.Значение            = Ссылка[Реквизит];
			НоваяЗапись.Пользователь        = АвторизованныйПользователь;
			НоваяЗапись.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СокрЛП(Идентификатор) <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Идентификатор", СокрЛП(Идентификатор));
		Запрос.УстановитьПараметр("Ссылка",        Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	Scan_СоставляющиеРасчетаЦеныПродуктов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов КАК Scan_СоставляющиеРасчетаЦеныПродуктов
		|ГДЕ
		|	Scan_СоставляющиеРасчетаЦеныПродуктов.Идентификатор = &Идентификатор
		|	И Scan_СоставляющиеРасчетаЦеныПродуктов.Ссылка <> &Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Идентификатор составляющей не уникальный! Составляющая '; en = 'Identifier of the component is not unique! Component ""'") + Выборка.Ссылка + НСтр("ru = ' имеет такой же идентификатор.'; en = ' has the same identifier.'");
			Сообщение.Поле = "Идентификатор";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НетИсторииВРегистре(СоставляющаяРасчета) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СоставляющаяРасчета", СоставляющаяРасчета);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов КАК Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов
	|ГДЕ
	|	Scan_ХарактеристикиСоставляющейРасчетыЦеныПродуктов.СоставляющаяРасчета = &СоставляющаяРасчета";
	
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли
